export const me = {
	name: "Савкина Мария",
	profession: "Frontend-разработчик",
	city: "г. Санкт-Петербург",
	email: "mashh@mail.ru",
	number: "+79055187737",
	about:
		"Привет! Я web-разработчик, создаю проекты на React и Typescript, особенно люблю Next.js. Еще в школе я делала сайты на HTML, и это увлечение осталось с мной. Работая в оптовой торговле, я общалась с клиентами и решала бизнес-задачи, но затем решила полностью перейти в разработку и поступила в GeekBrains. Там я изучила React, SQL, Java, Python, Git, Docker, а также основы ООП, алгоритмов и баз данных. Я участвовала в frontend-разработке для стартапа по GPS-мониторингу и проектов для “Сколтеха”. Ищу предложения на должность React-разработчика.",
	birthday: "11.05.1985",
	maritalStatus: "замужем",
};

export const languages = [
	{ name: "Русский", level: "родной" },
	{ name: "Английский", level: "уровень B1" },
	{ name: "Испанский", level: "уровень A1" },
];

export const hardSkills = [
	"JavaScript",
	"TypeScript",
	"React",
	"Next JS",
	"HTML",
	"CSS",
	"SASS",
	"Git",
	"Node.js",
	"REST",
	"MobX",
	"Leaflet",
	"Figma",
];

export const softSkills = [
	"Умею слушать",
	"Хорошо работаю в команде",
	"Нацелена на результат",
	"Умею управлять эмоциями",
	"Занимаюсь своим развитием",
	"Имею логическое мышление",
	"Умею искать информацию",
	"Умею брать на себя ответственность",
];

export const projects = [
	{
		name: "GPS-мониторинг мобильных устройств",
		url: "https://gps-mon.ru/",
	},
	{
		name: "Онлайн-занятия фитнесом",
		url: "https://github.com/mashhroma/fitSteps",
	},
	{
		name: "Проект интернет-магазина",
		url: "https://github.com/mashhroma/exampleShop",
	},
	{
		name: "Различные проекты",
		url: "https://github.com/mashhroma?tab=repositories",
	},
];

export const experience = [
	{
		timeline: "Август 2024 — по настоящее время",
		position: "Frontend-разработчик",
		company:
			"The Skolkovo Institute of Science and Technology, Москва, разработка программного обеспечения",
		duties: [
			"Интегрировала различные модули на онлайн-платформу, используя библиотеку Leaflet",
			"Обновила дизайн платформы с использованием SASS",
			"Внедрила функциональность с файловой загрузкой и выгрузкой по API больших файлов",
		],
	},

	{
		timeline: "Март 2024 — август 2024",
		position: "Frontend-разработчик",
		company: "GPS-монитор, Москва, IT-услуги",
		duties: [
			"Создание интерфейса пользователя на Next JS",
			"Верстка по макету дизайнера с использованием SASS",
			"Создание взаимодействия пользователя с картой на базе библиотеки Leaflet",
		],
	},

	// {
	// 	timeline: "Ноябрь 2023 — Май 2024",
	// 	position: "Web-программист",
	// 	company: "Проектная деятельность",
	// 	duties: [
	// 		"Разработала проект web-приложения на React.",
	// 		"Решала прочие учебные задачи.",
	// 	],
	// },

	// {
	// 	timeline: "Октябрь 2022 — по настоящее время",
	// 	position: "Специалист отдела качества поиска",
	// 	company: `"Яндекс Крауд", Москва, поисковая система`,
	// 	duties: [
	// 		"Выполняю задачи для повышения качества поиска.",
	// 		"Выполняю задачи, связанные с разметкой поисковой выдачи.",
	// 	],
	// },

	// {
	// 	timeline: "Сентябрь 2019 — Ноябрь 2022",
	// 	position: "Старший менеджер направления оптовых продаж",
	// 	company: `"Итума", Москва, оптовая торговля текстильных изделий`,
	// 	duties: [
	// 		"Подключила компанию к системе учета Честный знак.",
	// 		"Налаживала контакт с покупателями.",
	// 		"Анализировала показатели продаж.",
	// 		"Контролировала сроки и качество выполнения отгрузок и заказов.",
	// 	],
	// },
];

export const education = [
	{
		faculty: "Frontend-программист (React)",
		type: "Профессиональная переподготовка",
		place: "GeekBrains",
		years: "2022-2024",
	},
	{
		faculty: "Менеджмент организации",
		type: "Неоконченное высшее",
		place:
			"Московский государственный университет приборостроения и информатики",
		years: "2006-2009",
	},
	{
		faculty: "Государственное и муниципальное управление",
		type: "Среднее специальное",
		place: "Московский государственный колледж информационных технологий",
		years: "2004-2006",
	},
];
